Tekla Open API Reference for Tekla Structures 2025
HelpViewer Methods
The HelpViewer type exposes the following members.
Methods
Name | Description
DisplayHelpTopic
 Method for opening Tekla Structures help viewer with given help topic. Method requires Tekla Structures to be running.
DisplayHelpTopicIndependent
 Method for opening Tekla Structures help viewer independently from given file path with given help topic and language.
Top
See Also
Reference
HelpViewer Class
Tekla.Structures.Dialog Namespace